{
    "additionDate": "2020-01-14T20:18:01Z",
    "biotoolsCURIE": "biotools:16S",
    "biotoolsID": "16S",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "l.carruthers.1@research.gla.ac.uk",
            "name": "Lauren V. Carruthers",
            "orcidid": "https://orcid.org/0000-0003-4346-2283",
            "typeEntity": "Person"
        }
    ],
    "description": "The impact of storage conditions on human stool 16S rRNA microbiome composition and diversity.\n\nBackground:Multiple factors can influence stool sample integrity upon sample collection. Preservation of faecal samples for microbiome studies is therefore an important step, particularly in tropical regions where resources are limited and high temperatures may significantly influence microbiota profiles. Freezing is the accepted standard to preserve faecal samples however, cold chain methods are often unfeasible in fieldwork scenarios particularly in low and middle-income countries and alternatives are required.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'stool', 'time-to-freezing', 'microbiome' (bio.tools/microbiome), 'fieldwork'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Quantification",
                    "uri": "http://edamontology.org/operation_3799"
                },
                {
                    "term": "Sequence trimming",
                    "uri": "http://edamontology.org/operation_3192"
                },
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://support.illumina.com/documents/documentation/chemistry_documentation/16s/16s-metagenomic-library-prep-guide-15044223-b.pdf",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-14T20:18:01Z",
    "name": "16S",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.7717/PEERJ.8133",
            "metadata": {
                "abstract": "Copyright 2019 Carruthers et al.Background: Multiple factors can influence stool sample integrity upon sample collection. Preservation of faecal samples for microbiome studies is therefore an important step, particularly in tropical regions where resources are limited and high temperatures may significantly influence microbiota profiles. Freezing is the accepted standard to preserve faecal samples however, cold chain methods are often unfeasible in fieldwork scenarios particularly in low and middle-income countries and alternatives are required. This study therefore aimed to address the impact of different preservative methods, time-to-freezing at ambient tropical temperatures, and stool heterogeneity on stool microbiome diversity and composition under real-life physical environments found in resource-limited fieldwork conditions. Methods: Inner and outer stool samples collected from one specimen obtained from three children were stored using different storage preservation methods (raw, ethanol and RNAlater) in a Ugandan field setting. Mixed stool was also stored using these techniques and frozen at different time-to-freezing intervals post-collection from 0–32 h. Metataxonomic profiling was used to profile samples, targeting the V1–V2 regions of 16S rRNA with samples run on a MiSeq platform. Reads were trimmed, combined and aligned to the Greengenes database. Microbial diversity and composition data were generated and analysed using Quantitative Insights Into Microbial Ecology and R software. Results: Child donor was the greatest predictor of microbiome variation between the stool samples, with all samples remaining identifiable to their child of origin despite the stool being stored under a variety of conditions. However, significant differences were observed in composition and diversity between preservation techniques, but intra-preservation technique variation was minimal for all preservation methods, and across the time-to-freezing range (0–32 h) used. Stool heterogeneity yielded no apparent microbiome differences. Conclusions: Stool collected in a fieldwork setting for comparative microbiome analyses should ideally be stored as consistently as possible using the same preservation method throughout.",
                "authors": [
                    {
                        "name": "Carruthers L.V."
                    },
                    {
                        "name": "Moses A."
                    },
                    {
                        "name": "Adriko M."
                    },
                    {
                        "name": "Faust C.L."
                    },
                    {
                        "name": "Tukahebwa E.M."
                    },
                    {
                        "name": "Hall L.J."
                    },
                    {
                        "name": "Ranford-Cartwright L.C."
                    },
                    {
                        "name": "Lamberton P.H.L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "PeerJ",
                "title": "The impact of storage conditions on human stool 16S rRNA microbiome composition and diversity"
            },
            "pmcid": "PMC6894433",
            "pmid": "31824766"
        }
    ],
    "topic": [
        {
            "term": "Microbial ecology",
            "uri": "http://edamontology.org/topic_3697"
        },
        {
            "term": "Functional, regulatory and non-coding RNA",
            "uri": "http://edamontology.org/topic_0659"
        },
        {
            "term": "Sample collections",
            "uri": "http://edamontology.org/topic_3277"
        }
    ]
}