{
    "additionDate": "2020-01-14T09:34:43Z",
    "biotoolsCURIE": "biotools:PSSRdt",
    "biotoolsID": "PSSRdt",
    "confidence_flag": "medium",
    "credit": [
        {
            "email": "maohua.chen@nwsuaf.edu.cn",
            "name": "Maohua Chen",
            "orcidid": "https://orcid.org/0000-0001-8599-2771",
            "typeEntity": "Person"
        }
    ],
    "description": "A Novel Software and Method for the Efficient Development of Polymorphic SSR Loci Based on Transcriptome Data.\n\nWelcome to GitHub—where millions of developers work together on software. Ready to get started? Let’s learn how this all works by building and publishing your first GitHub Pages website!.\n\nRight now, we’re in your first GitHub repository. A repository is like a folder or storage space for your project. Your project's repository contains all its files such as code, documentation, images, and more. It also tracks every change that you—or your collaborators—make to each file, so you can always go back to previous versions of your project if you make any mistakes.\n\nThis repository contains three important files: The HTML code for your first website on GitHub, the CSS stylesheet that decorates your website with colors and fonts, and the README file. It also contains an image folder, with one image file.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'SSR'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "De-novo assembly",
                    "uri": "http://edamontology.org/operation_0524"
                },
                {
                    "term": "Repeat sequence analysis",
                    "uri": "http://edamontology.org/operation_0237"
                },
                {
                    "term": "Genotyping",
                    "uri": "http://edamontology.org/operation_3196"
                },
                {
                    "term": "Transcriptome assembly",
                    "uri": "http://edamontology.org/operation_3258"
                },
                {
                    "term": "PCR primer design",
                    "uri": "http://edamontology.org/operation_0308"
                }
            ]
        }
    ],
    "homepage": "https://github.com/PSSRdt/program",
    "language": [
        "Perl"
    ],
    "lastUpdate": "2020-01-14T09:34:43Z",
    "name": "PSSRdt",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/GENES10110917",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Traditional methods for developing polymorphic microsatellite loci without reference sequences are time-consuming and labor-intensive, and the polymorphisms of simple sequence repeat (SSR) loci developed from expressed sequence tag (EST) databases are generally poor. To address this issue, in this study, we developed a new software (PSSRdt) and established an effective method for directly obtaining polymorphism details of SSR loci by analyzing diverse transcriptome data. The new method includes three steps, raw data processing, PSSRdt application, and loci extraction and verification. To test the practicality of the method, we successfully obtained 1940 potential polymorphic SSRs from the transcript dataset combined with 44 pea aphid transcriptomes. Fifty-two SSR loci obtained by the new method were selected for validating the polymorphic characteristics by genotyping in pea aphid individuals. The results showed that over 92% of SSR loci were polymorphic and 73.1% of loci were highly polymorphic. Our new software and method provide an innovative approach to microsatellite development based on RNA-seq data, and open a new path for the rapid mining of numerous loci with polymorphism to add to the body of research on microsatellites.",
                "authors": [
                    {
                        "name": "Tian R."
                    },
                    {
                        "name": "Zhang C."
                    },
                    {
                        "name": "Huang Y."
                    },
                    {
                        "name": "Guo X."
                    },
                    {
                        "name": "Chen M."
                    }
                ],
                "date": "2019-11-01T00:00:00Z",
                "journal": "Genes",
                "title": "A novel software and method for the efficient development of polymorphic SSR loci based on transcriptome data"
            },
            "pmcid": "PMC6895799",
            "pmid": "31717904"
        }
    ],
    "topic": [
        {
            "term": "DNA polymorphism",
            "uri": "http://edamontology.org/topic_2885"
        },
        {
            "term": "Transcriptomics",
            "uri": "http://edamontology.org/topic_3308"
        },
        {
            "term": "RNA-Seq",
            "uri": "http://edamontology.org/topic_3170"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Genotype and phenotype",
            "uri": "http://edamontology.org/topic_0625"
        }
    ]
}