{
    "additionDate": "2020-01-09T18:35:42Z",
    "biotoolsCURIE": "biotools:cancer_autogenerated",
    "biotoolsID": "cancer_autogenerated",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "wmh7001@163.com",
            "name": "Mianhua Wu",
            "typeEntity": "Person"
        }
    ],
    "description": "Identification of key pathways and genes in colorectal cancer to predict the prognosis based on mRNA interaction network.\n\nThe Cancer Genome Atlas (TCGA) is a landmark cancer genomics program that sequenced and molecularly characterized over 11,000 cases of primary cancer samples. Learn more about how the program transformed the cancer research community and beyond.\n\n||| NAME (cancer) SIMILAR TO (PUB. DIFFERENT) bio.tools/cancer (canceR).\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'limma' (bio.tools/limma), 'CRC' (bio.tools/CRC), 'KEGG', 'CDKN1A'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Pathway or network prediction",
                    "uri": "http://edamontology.org/operation_3439"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Pathway or network visualisation",
                    "uri": "http://edamontology.org/operation_3083"
                }
            ]
        }
    ],
    "homepage": "https://www.cancer.gov/tcga",
    "language": [
        "R"
    ],
    "lastUpdate": "2020-01-09T18:35:42Z",
    "name": "cancer_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/OL.2019.10698",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.The aim of the present study was to identify key genes in colorectal cancer (CRC) that could be used to reliably diagnose this disease and to explore the potential underlying mechanisms in silico. The gene expression profiles of primary human cancer datasets GSE21510 and GSE32323 were downloaded from the Gene Expression Omnibus database. The limma R software package was used to identify differentially expressed (DE) genes. Gene Ontology and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analyses were performed on DE genes using the Database for Annotation, Visualization and Integrated Discovery. The Search Tool for the Retrieval of Interacting Genes/Proteins database was used to construct a protein-protein interaction (PPI) network of the DE genes. Survival rate was analyzed and visualized using The Cancer Genome Atlas (TCGA). A total of 1,126 genes were significantly DE in the present study. All DE genes were enriched in KEGG pathways including 'cell cycle', 'mineral absorption', 'pancreatic secretion', 'pathways in cancer', 'metabolic pathways', 'aldosterone-regulated sodium reabsorption' and 'Wnt signaling pathway'. A total of 5 hub genes enriched in cell cycle and tumor-associated pathways, including E2F2, SKP2, MYC, CDKN1A and CDKN2B, were significantly DE and validated between tumor and normal tissues. CDKN1A and CDKN2B were identified within the PPI network using the Molecular Complex Detection algorithm. Survival and content distribution analyses of 362 clinical samples from TCGA revealed that CDKN1A effectively predicted the prognosis of patients. The present study identified key genes and potential signaling pathways involved in CRC. These findings may provide new insights for survival assessment during the clinical diagnosis of CRC.",
                "authors": [
                    {
                        "name": "Zhu H."
                    },
                    {
                        "name": "Ji Y."
                    },
                    {
                        "name": "Li W."
                    },
                    {
                        "name": "Wu M."
                    }
                ],
                "citationCount": 1,
                "date": "2019-01-01T00:00:00Z",
                "journal": "Oncology Letters",
                "title": "Identification of key pathways and genes in colorectal cancer to predict the prognosis based on mRNA interaction network"
            },
            "pmcid": "PMC6757265",
            "pmid": "31579079"
        }
    ],
    "topic": [
        {
            "term": "Oncology",
            "uri": "http://edamontology.org/topic_2640"
        },
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        },
        {
            "term": "Gene transcripts",
            "uri": "http://edamontology.org/topic_3512"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}