{
    "additionDate": "2019-11-14T20:06:16Z",
    "biotoolsCURIE": "biotools:GEO2R_autogenerated",
    "biotoolsID": "GEO2R_autogenerated",
    "confidence_flag": "low",
    "credit": [
        {
            "email": "huangcibo1208@139.com",
            "name": "Ci-Bo Huang",
            "typeEntity": "Person"
        }
    ],
    "description": "> LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ncbi_geo (NLM.NIH.GOV/geo ; NCBI.NLM.NIH.GOV/geo), bio.tools/ncbi_resources (NLM.NIH.GOV), bio.tools/genbank (NLM.NIH.GOV) | > CORRECT NAME OF TOOL COULD ALSO BE 'KEGG', 'spinal cord injury', 'TLR4', 'SSc', 'CALU', 'microRNA-TF', 'Npy Atf3', 'DEGs', 'Npy', 'spinal cord injury zebrafish', 'cord injury', 'spinal cord' | Screening and identification of biomarkers for systemic sclerosis via microarray technology | Identification of key candidate genes in neuropathic pain by integrated bioinformatic analysis | Bioinformatic identification of key candidate genes and pathways in axon regeneration after spinal cord injury in zebrafish | Gene Expression Omnibus (GEO) is a database repository of high throughput gene expression data and hybridization arrays, chips, microarrays | Use GEO2R to compare two or more groups of Samples in order to identify genes that are differentially expressed across experimental conditions",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Expression profile clustering",
                    "uri": "http://edamontology.org/operation_0313"
                },
                {
                    "term": "Enrichment analysis",
                    "uri": "http://edamontology.org/operation_3501"
                },
                {
                    "term": "Differential gene expression analysis",
                    "uri": "http://edamontology.org/operation_3223"
                }
            ]
        }
    ],
    "homepage": "http://www.ncbi.nlm.nih.gov/geo/geo2r/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T20:06:16Z",
    "link": [
        {
            "type": [
                "Other"
            ],
            "url": "http://www.ncbi.nlm.nih.gov/geo"
        }
    ],
    "name": "GEO2R_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3892/IJMM.2019.4332",
            "metadata": {
                "abstract": "© 2019 Spandidos Publications. All rights reserved.Systemic sclerosis (SSc) is a complex autoimmune disease. The pathogenesis of SSc is currently unclear, although like other rheumatic diseases its pathogenesis is complicated. However, the ongoing development of bioinformatics technology has enabled new approaches to research this disease using microarray technology to screen and identify differentially expressed genes (DEGs) in the skin of patients with SSc compared with individuals with healthy skin. Publicly available data were downloaded from the Gene Expression Omnibus (GEO) database and intra-group data repeatability tests were conducted using Pearson’s correlation test and principal component analysis. DEGs were identified using an online tool, GEO2R. Functional annotation of DEGs was performed using Gene Ontology (GO) and the Kyoto Encyclopedia of Genes and Genomes (KEGG) analysis. Finally, the construction and analysis of the protein‑protein interaction (PPI) network and identification and analysis of hub genes was carried out. A total of 106 DEGs were detected by the screening of SSc and healthy skin samples. A total of 10 genes [interleukin-6, bone morphogenetic protein 4, calumenin (CALU), clusterin, cysteine rich angiogenic inducer 61, serine protease 23, secretogranin II, suppressor of cytokine signaling 3, Toll-like receptor 4 (TLR4), tenascin C] were identified as hub genes with degrees ≥10, and which could sensitively and specifically predict SSc based on receiver operator characteristic curve analysis. GO and KEGG analysis showed that variations in hub genes were mainly enriched in positive regulation of nitric oxide biosynthetic processes, negative regulation of apoptotic processes, extracellular regions, extracellular spaces, cytokine activity, chemo-attractant activity, and the phosphoinositide 3 kinase-protein kinase B signaling pathway. In summary, bioinformatics techniques proved useful for the screening and identification of biomarkers of disease. A total of 106 DEGs and 10 hub genes were linked to SSc, in particular the TLR4 and CALU genes.",
                "authors": [
                    {
                        "name": "Xu C."
                    },
                    {
                        "name": "Meng L.-B."
                    },
                    {
                        "name": "Duan Y.-C."
                    },
                    {
                        "name": "Cheng Y.-J."
                    },
                    {
                        "name": "Zhang C.-M."
                    },
                    {
                        "name": "Zhou X."
                    },
                    {
                        "name": "Huang C.-B."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "International Journal of Molecular Medicine",
                "title": "Screening and identification of biomarkers for systemic sclerosis via microarray technology"
            },
            "pmcid": "PMC6777682",
            "pmid": "31545397"
        },
        {
            "doi": "10.1002/JCB.29398",
            "metadata": {
                "abstract": "© 2019 Wiley Periodicals, Inc.This study aimed to disclose differentially expressed genes (DEGs) in dorsal root ganglia (DRGs) of neuropathic pain (NP) from spared nerve injury (SNI) model, thereby identifying specific and meaningful genetic targets for the diagnosis and treatment of NP. The GSE89224 was downloaded from the GEO database. DEGs were screened using the GEO2R online tool. Functional enrichment analysis of DEGs was then performed using the DAVID and constructed using the R ggplot2 package. Protein-protein interaction (PPI) network was constructed from the STRING database and visualized in Cytoscape software. MicroRNA targeting these DEGs was obtained from the TarBase and miRTarBase database, while transcription factor (TF)-targeting DEGs were predicted from the ENCODE database, both of which utilized the visual analytics platform NetworkAnayst. Finally, a merged microRNA-TF network was constructed based on the above two networks and was then analyzed with Cytoscape. Eighty DEGs were screened, only Vstm2b and Htr3a were downregulated and 78 genes were upregulated. The real-time polymerase chain reaction was applied to validate the gene expression of the top five DEGs (Npy, Atf3, Gpr151, Sprr1a, and Cckbr) in the DRG tissue 5 days after SNI surgery. It was found that Npy, Atf3, and Sprr1a have a significant increase after SNI stimulation, while Gpr151 and Cckbr showed a slight upward trend. Functional analysis was performed on all DEGs, of which 58 biological processes were enriched by gene ontology analysis, and 11 signaling pathways were enriched by KEGG analysis. In the PPI network, Atf3, Jun, Timp, and Npy had a higher degree. Thus, combined with various bioinformatic analyses, Npy and Atf3 may serve as the prognostic and therapeutic targets of NP. Key microRNA (mmu-mir-16-5p) and TF (MEF2A) were predicted to be associated with the pathogenetic process of NP with microRNA-TF regulatory network analysis, which were also identified as key regulators in the progression of NP.",
                "authors": [
                    {
                        "name": "Tang S."
                    },
                    {
                        "name": "Jing H."
                    },
                    {
                        "name": "Huang Z."
                    },
                    {
                        "name": "Huang T."
                    },
                    {
                        "name": "Lin S."
                    },
                    {
                        "name": "Liao M."
                    },
                    {
                        "name": "Zhou J."
                    }
                ],
                "date": "2019-01-01T00:00:00Z",
                "journal": "Journal of Cellular Biochemistry",
                "title": "Identification of key candidate genes in neuropathic pain by integrated bioinformatic analysis"
            },
            "pmid": "31535407"
        },
        {
            "doi": "10.4103/1673-5374.264460",
            "pmid": "31535658"
        }
    ],
    "topic": [
        {
            "term": "Biomarkers",
            "uri": "http://edamontology.org/topic_3360"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Molecular interactions, pathways and networks",
            "uri": "http://edamontology.org/topic_0602"
        }
    ]
}