{
    "additionDate": "2019-11-14T19:50:12Z",
    "biotoolsCURIE": "biotools:CABE",
    "biotoolsID": "CABE",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "laurent.segers@vub.be",
            "name": "Laurent Segers",
            "orcidid": "https://orcid.org/0000-0002-6071-0026",
            "typeEntity": "Person"
        }
    ],
    "description": "> CORRECT NAME OF TOOL COULD ALSO BE 'Cloud-based Acoustic Beamforming', 'Cloud-based Acoustic Beamforming Emulator' | A Cloud-Based Acoustic Beamforming Emulator for FPGA-Based Sound Source Localization | Microphone array online emulator | Welcome to the Microphone Array Emulator platform of the RAPPTORlab at the Vrije Universiteit Brussel. From this website one can emulate the behaviour of a microphone array along with the required Signal Processing Chain. It is also possible to compute captured samples from measurements with microphones. After computation, the results can be visualized in both 2D and 3D. Launching emulations and visualizing results can be done by using the tools provided at the download section | A few steps are required before one can launch emulations and visualize results: | Create an account on our platform. We kindly ask to provide the full name, e-mail address and institution of affiliation | Each account needs to be approved by the administrator of the tool",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Visualisation",
                    "uri": "http://edamontology.org/operation_0337"
                }
            ]
        }
    ],
    "homepage": "https://projects.rapptor.vub.ac.be/CABE/",
    "lastUpdate": "2019-11-14T19:50:12Z",
    "name": "CABE",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.3390/S19183906",
            "metadata": {
                "abstract": "© 2019 by the authors. Licensee MDPI, Basel, Switzerland.Microphone arrays are gaining in popularity thanks to the availability of low-cost microphones. Applications including sonar, binaural hearing aid devices, acoustic indoor localization techniques and speech recognition are proposed by several research groups and companies. In most of the available implementations, the microphones utilized are assumed to offer an ideal response in a given frequency domain. Several toolboxes and software can be used to obtain a theoretical response of a microphone array with a given beamforming algorithm. However, a tool facilitating the design of a microphone array taking into account the non-ideal characteristics could not be found. Moreover, generating packages facilitating the implementation on Field Programmable Gate Arrays has, to our knowledge, not been carried out yet. Visualizing the responses in 2D and 3D also poses an engineering challenge. To alleviate these shortcomings, a scalable Cloud-based Acoustic Beamforming Emulator (CABE) is proposed. The non-ideal characteristics of microphones are considered during the computations and results are validated with acoustic data captured from microphones. It is also possible to generate hardware description language packages containing delay tables facilitating the implementation of Delay-and-Sum beamformers in embedded hardware. Truncation error analysis can also be carried out for fixed-point signal processing. The effects of disabling a given group of microphones within the microphone array can also be calculated. Results and packages can be visualized with a dedicated client application. Users can create and configure several parameters of an emulation, including sound source placement, the shape of the microphone array and the required signal processing flow. Depending on the user configuration, 2D and 3D graphs showing the beamforming results, waterfall diagrams and performance metrics can be generated by the client application. The emulations are also validated with captured data from existing microphone arrays.",
                "authors": [
                    {
                        "name": "Segers L."
                    },
                    {
                        "name": "Vandendriessche J."
                    },
                    {
                        "name": "Vandervelden T."
                    },
                    {
                        "name": "Lapauw B.J."
                    },
                    {
                        "name": "Silva B.D."
                    },
                    {
                        "name": "Braeken A."
                    },
                    {
                        "name": "Touhafi A."
                    }
                ],
                "date": "2019-09-02T00:00:00Z",
                "journal": "Sensors (Switzerland)",
                "title": "Cabe: A cloud-based acoustic beamforming emulator for fpga-based sound source localization"
            },
            "pmcid": "PMC6767114",
            "pmid": "31510098"
        }
    ],
    "topic": [
        {
            "term": "Transcription factors and regulatory sites",
            "uri": "http://edamontology.org/topic_0749"
        }
    ]
}