{
    "additionDate": "2020-01-14T19:53:06Z",
    "biotoolsCURIE": "biotools:PRIME-Tool",
    "biotoolsID": "PRIME-Tool",
    "confidence_flag": "high",
    "credit": [
        {
            "email": "abitton@partners.org",
            "name": "Asaf Bitton",
            "orcidid": "https://orcid.org/0000-0002-3633-3806",
            "typeEntity": "Person"
        }
    ],
    "description": "Preliminary validation of the PRImary care facility Management Evaluation tool (PRIME-Tool).\n\nBACKGROUND:The management quality of healthcare facilities has consistently been linked to facility performance, but available tools to measure management are costly to implement, often hospital-specific, not designed for low- and middle-income countries (LMICs), nor widely deployed. We addressed this gap by developing the PRImary care facility Management Evaluation Tool (PRIME-Tool), a primary health care facility management survey for integration into routine national surveys in LMICs. We present an analysis of the tool's psychometric properties and suggest directions for future improvements. METHODS:The PRIME-Tool assesses performance in five core management domains: Target setting, Operations, Human resources, Monitoring, and Community engagement. We evaluated two versions of the PRIME-Tool.\n\n||| HOMEPAGE MISSING!",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Validation",
                    "uri": "http://edamontology.org/operation_2428"
                },
                {
                    "term": "Splitting",
                    "uri": "http://edamontology.org/operation_3359"
                },
                {
                    "term": "Service management",
                    "uri": "http://edamontology.org/operation_3760"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/pubmed/?term=31805931",
    "lastUpdate": "2020-01-14T19:53:06Z",
    "name": "PRIME-Tool",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12913-019-4768-8",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: The management quality of healthcare facilities has consistently been linked to facility performance, but available tools to measure management are costly to implement, often hospital-specific, not designed for low- and middle-income countries (LMICs), nor widely deployed. We addressed this gap by developing the PRImary care facility Management Evaluation Tool (PRIME-Tool), a primary health care facility management survey for integration into routine national surveys in LMICs. We present an analysis of the tool's psychometric properties and suggest directions for future improvements. Methods: The PRIME-Tool assesses performance in five core management domains: Target setting, Operations, Human resources, Monitoring, and Community engagement. We evaluated two versions of the PRIME-Tool. We surveyed 142 primary health care (PHC) facilities in Ghana in 2016 using the first version (27 items) and 148 facilities in 2017 using the second version (34 items). We calculated floor and ceiling effects for each item and conducted exploratory factor analyses to examine the factor structure for each year and version of the tool. We developed a revised management framework and PRIME-tool as informed by these exploratory results, further review of management theory literature, and co-author consensus. Results: The majority (17 items in 2016, 23 items in 2017) of PRIME-Tool items exhibited ceiling effects, but only three (2 items in 2016, 3 items in 2017) showed floor effects. Solutions suggested by factor analyses did not fully fit our initial hypothesized management domains. We found five groupings of items that consistently loaded together across each analysis and named these revised domains as Supportive supervision and target setting, Active monitoring and review, Community engagement, Client feedback for improvement, and Operations and financing. Conclusion: The revised version of the PRIME-Tool captures a range of important and actionable information on the management of PHC facilities in LMIC contexts. We recommend its use by other investigators and practitioners to further validate its utility in PHC settings. We will continue to refine the PRIME-Tool to arrive at a parsimonious tool for tracking PHC facility management quality. Better understanding the functional components of PHC facility management can help policymakers and frontline managers drive evidence-based improvements in performance.",
                "authors": [
                    {
                        "name": "Uy J."
                    },
                    {
                        "name": "Macarayan E.K."
                    },
                    {
                        "name": "Ratcliffe H.L."
                    },
                    {
                        "name": "Miller K."
                    },
                    {
                        "name": "Otupiri E."
                    },
                    {
                        "name": "Awoonor-Williams J.K."
                    },
                    {
                        "name": "Hirschhorn L.R."
                    },
                    {
                        "name": "Lipsitz S.R."
                    },
                    {
                        "name": "Schwarz D."
                    },
                    {
                        "name": "Bitton A."
                    }
                ],
                "date": "2019-12-05T00:00:00Z",
                "journal": "BMC Health Services Research",
                "title": "Preliminary validation of the PRImary care facility Management Evaluation tool (PRIME-Tool), a national facility management survey implemented in Ghana"
            },
            "pmcid": "PMC6896786",
            "pmid": "31805931"
        }
    ],
    "topic": [
        {
            "term": "Literature and language",
            "uri": "http://edamontology.org/topic_3068"
        },
        {
            "term": "Informatics",
            "uri": "http://edamontology.org/topic_0605"
        },
        {
            "term": "Reproductive health",
            "uri": "http://edamontology.org/topic_3420"
        }
    ]
}