{
    "accessibility": "Open access",
    "additionDate": "2020-09-22T13:27:56.654488",
    "biotoolsCURIE": "biotools:sans",
    "biotoolsID": "sans",
    "collectionID": [
        "de.NBI"
    ],
    "cost": "Free of charge",
    "description": "SANS is a freely available command line tool for phylogenetic \nreconstruction. It is alignment- and reference-free, and accepts \n(multiple) FASTA or FASTQ files containing complete genomes, assembled \ncontigs, or raw reads as input. Sequence segments (in terms of k-mers) \nthat are shared by a set of genomes are used as indicators for \nphylogenetic splits. Splits are combined, weighted, filtered and output \nin tab separated format. They can visualized as a phylogenetic tree or \nnetwork using existing tools such as SplitsTree. SANS is implemented in \nC++, and converter scripts for newick and nexus are provided.",
    "editPermission": {
        "authors": [
            "sebastian.juenemann@uni-bielef"
        ],
        "type": "group"
    },
    "function": [
        {
            "input": [
                {
                    "data": {
                        "term": "Sequence set (nucleic acid)",
                        "uri": "http://edamontology.org/data_1234"
                    },
                    "format": [
                        {
                            "term": "Sequence record format",
                            "uri": "http://edamontology.org/format_1919"
                        }
                    ]
                }
            ],
            "note": "Nexus and Newick format can be obtained from TSV output by converter scripts (provided).\nIt also takes a Bifrost graph (Holley and Melsted) as input.",
            "operation": [
                {
                    "term": "Phylogenetic reconstruction",
                    "uri": "http://edamontology.org/operation_3478"
                }
            ],
            "output": [
                {
                    "data": {
                        "term": "Phylogenetic tree",
                        "uri": "http://edamontology.org/data_0872"
                    },
                    "format": [
                        {
                            "term": "TSV",
                            "uri": "http://edamontology.org/format_3475"
                        }
                    ]
                }
            ]
        }
    ],
    "homepage": "https://gitlab.ub.uni-bielefeld.de/gi/sans",
    "language": [
        "C++",
        "Python"
    ],
    "lastUpdate": "2020-09-22T13:27:56.656895Z",
    "license": "GPL-3.0",
    "link": [
        {
            "type": [
                "Repository"
            ],
            "url": "https://gitlab.ub.uni-bielefeld.de/gi/sans"
        }
    ],
    "maturity": "Mature",
    "name": "SANS",
    "owner": "rwittler",
    "publication": [
        {
            "doi": "10.1186/s13015-020-00164-3",
            "metadata": {
                "abstract": "© 2020 The Author(s).Background: The increasing amount of available genome sequence data enables large-scale comparative studies. A common task is the inference of phylogenies - a challenging task if close reference sequences are not available, genome sequences are incompletely assembled, or the high number of genomes precludes multiple sequence alignment in reasonable time. Results: We present a new whole-genome based approach to infer phylogenies that is alignment- and reference-free. In contrast to other methods, it does not rely on pairwise comparisons to determine distances to infer edges in a tree. Instead, a colored de Bruijn graph is constructed, and information on common subsequences is extracted to infer phylogenetic splits. Conclusions: The introduced new methodology for large-scale phylogenomics shows high potential. Application to different datasets confirms robustness of the approach. A comparison to other state-of-the-art whole-genome based methods indicates comparable or higher accuracy and efficiency.",
                "authors": [
                    {
                        "name": "Wittler R."
                    }
                ],
                "date": "2020-04-07T00:00:00Z",
                "journal": "Algorithms for Molecular Biology",
                "title": "Alignment- And reference-free phylogenomics with colored de Bruijn graphs"
            },
            "type": [
                "Method",
                "Benchmarking study"
            ]
        }
    ],
    "toolType": [
        "Command-line tool"
    ],
    "topic": [
        {
            "term": "Phylogenomics",
            "uri": "http://edamontology.org/topic_0194"
        },
        {
            "term": "Phylogenetics",
            "uri": "http://edamontology.org/topic_3293"
        }
    ]
}