{
    "additionDate": "2020-01-14T09:33:52Z",
    "biotoolsCURIE": "biotools:hh8rjjh73w",
    "biotoolsID": "hh8rjjh73w",
    "confidence_flag": "medium",
    "description": "Loading characteristics data applied on osseointegrated implant by transfemoral bone-anchored prostheses fitted with basic components during daily activities.\n\nInter-participant variability of loading characteristics applied on osseointegrated implant by transfemoral bone-anchored prostheses fitted with basic components during daily activities.\n\nThe mean and standard deviation as well as lower and upper limits of 95% confidence interval of the spatio-temporal gait characteristics, loading boundaries and loading extremum applied on osseointegrated implant by transfemoral bone-anchored prostheses fitted with basic components during level walking. ascending and descending ramp and stairs.\n\nPublished: 12 Aug 2019 : Version 1 : DOI: 10.17632/hh8rjjh73w.1.\n\n||| CORRECT NAME OF TOOL COULD ALSO BE 'osseointegrated implant transfemoral amputees', 'transfemoral amputees osseointegrated', 'transfemoral bone-anchored prostheses', 'transfemoral amputees'",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Standardisation and normalisation",
                    "uri": "http://edamontology.org/operation_3435"
                }
            ]
        }
    ],
    "homepage": "https://data.mendeley.com/datasets/hh8rjjh73w/1",
    "lastUpdate": "2020-01-14T09:33:52Z",
    "name": "hh8rjjh73w",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1016/J.DIB.2019.104492",
            "metadata": {
                "abstract": "© 2019 The Author(s)The data in this paper are related to the research articles entitled “Kinetics of transfemoral amputees with osseointegrated fixation performing common activities of daily living” (Lee et al., Clinical Biomechanics, 2007.22(6). p. 665–673) and “Magnitude and variability of loading on the osseointegrated implant of transfemoral amputees during walking” (Lee et al., Med Eng Phys, 2008.30(7). p. 825–833). This article contains the overall and individual loading characteristics applied on screw-type osseointegrated implant generated by transfemoral bone-anchored prostheses fitted with basic components during daily activities at self-selected comfortable pace. Overall and individual data was presented for the (A) spatio-temporal characteristics, (B) loading patterns, (C) loading boundaries and (D) the loading local extremum during level walking, ascending and descending ramp and stairs. Inter-participant variability of these new datasets with basic components is critical to improve the efficacy and safety of prosthetic components as well as the design of future automated algorithms and clinical trials. Online repository contains the files: https://data.mendeley.com/datasets/hh8rjjh73w/1.",
                "authors": [
                    {
                        "name": "Frossard L."
                    }
                ],
                "citationCount": 1,
                "date": "2019-10-01T00:00:00Z",
                "journal": "Data in Brief",
                "title": "Loading characteristics data applied on osseointegrated implant by transfemoral bone-anchored prostheses fitted with basic components during daily activities"
            },
            "pmcid": "PMC6811875",
            "pmid": "31667256"
        }
    ],
    "topic": [
        {
            "term": "Preclinical and clinical studies",
            "uri": "http://edamontology.org/topic_3379"
        }
    ]
}