{
    "additionDate": "2019-11-14T20:11:11Z",
    "biotoolsCURIE": "biotools:GEO_autogenerated",
    "biotoolsID": "GEO_autogenerated",
    "confidence_flag": "very low",
    "credit": [
        {
            "email": "weiyong2017@fjmu.edu.cn",
            "name": "Yong Wei",
            "typeEntity": "Person"
        },
        {
            "email": "xuexueyi@fjmu.edu.cn",
            "name": "Xue-Yi Xue",
            "orcidid": "https://orcid.org/0000-0002-6461-7435",
            "typeEntity": "Person"
        }
    ],
    "description": "> VERY_LOW CONFIDENCE! | > COMMON LINK WITH (PUB. & NAME DIFFERENT) bio.tools/ncbi_resources (NLM.NIH.GOV), bio.tools/ncbi_geo (NCBI.NLM.NIH.GOV/geo), bio.tools/genbank (NLM.NIH.GOV) | > CORRECT NAME OF TOOL COULD ALSO BE 'GSE112047', 'MethylMix' (bio.tools/methylmix), 'limma' (bio.tools/limma), 'GSE112047 GSE76938' | Identification of key DNA methylation-driven genes in prostate adenocarcinoma | Gene Expression Omnibus (GEO) is a database repository of high throughput gene expression data and hybridization arrays, chips, microarrays | GEO is a public functional genomics data repository supporting MIAME-compliant data submissions. Array- and sequence-based data are accepted. Tools are provided to help users query and download experiments and curated gene expression profiles",
    "editPermission": {
        "type": "public"
    },
    "function": [
        {
            "operation": [
                {
                    "term": "Whole genome methylation analysis",
                    "uri": "http://edamontology.org/operation_3206"
                },
                {
                    "term": "Expression analysis",
                    "uri": "http://edamontology.org/operation_2495"
                },
                {
                    "term": "Gene methylation analysis",
                    "uri": "http://edamontology.org/operation_3207"
                }
            ]
        }
    ],
    "homepage": "https://www.ncbi.nlm.nih.gov/geo/",
    "language": [
        "R"
    ],
    "lastUpdate": "2019-11-14T20:11:11Z",
    "name": "GEO_autogenerated",
    "owner": "Pub2Tools",
    "publication": [
        {
            "doi": "10.1186/S12967-019-2065-2",
            "metadata": {
                "abstract": "© 2019 The Author(s).Background: Prostate cancer (PCa) remains the second leading cause of deaths due to cancer in the United States in men. The aim of this study was to perform an integrative epigenetic analysis of prostate adenocarcinoma to explore the epigenetic abnormalities involved in the development and progression of prostate adenocarcinoma. The key DNA methylation-driven genes were also identified. Methods: Methylation and RNA-seq data were downloaded for The Cancer Genome Atlas (TCGA). Methylation and gene expression data from TCGA were incorporated and analyzed using MethylMix package. Methylation data from the Gene Expression Omnibus (GEO) were assessed by R package limma to obtain differentially methylated genes. Pathway analysis was performed on genes identified by MethylMix criteria using ConsensusPathDB. Gene Ontology (GO) term enrichment analysis and Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis were also applied for the identification of pathways in which DNA methylation-driven genes significantly enriched. The protein-protein interaction (PPI) network and module analysis in Cytoscape software were used to find the hub genes. Two methylation profile (GSE112047 and GSE76938) datasets were utilized to validate screened hub genes. Immunohistochemistry of these hub genes were evaluated by the Human Protein Atlas. Results: A total of 553 samples in TCGA database, 32 samples in GSE112047 and 136 samples in GSE76938 were included in this study. There were a total of 266 differentially methylated genes were identified by MethylMix. Plus, a total of 369 differentially methylated genes and 594 differentially methylated genes were identified by the R package limma in GSE112047 and GSE76938, respectively. GO term enrichment analysis suggested that DNA methylation-driven genes significantly enriched in oxidation-reduction process, extracellular exosome, electron carrier activity, response to reactive oxygen species, and aldehyde dehydrogenase [NAD(P)+] activity. KEGG pathway analysis found DNA methylation-driven genes significantly enriched in five pathways including drug metabolism-cytochrome P450, phenylalanine metabolism, histidine metabolism, glutathione metabolism, and tyrosine metabolism. The validated hub genes were MAOB and RTP4. Conclusions: Methylated hub genes, including MAOB and RTP4, can be regarded as novel biomarkers for accurate PCa diagnosis and treatment. Further studies are needed to draw more attention to the roles of these hub genes in the occurrence and development of PCa.",
                "authors": [
                    {
                        "name": "Xu N."
                    },
                    {
                        "name": "Wu Y.-P."
                    },
                    {
                        "name": "Ke Z.-B."
                    },
                    {
                        "name": "Liang Y.-C."
                    },
                    {
                        "name": "Cai H."
                    },
                    {
                        "name": "Su W.-T."
                    },
                    {
                        "name": "Tao X."
                    },
                    {
                        "name": "Chen S.-H."
                    },
                    {
                        "name": "Zheng Q.-S."
                    },
                    {
                        "name": "Wei Y."
                    },
                    {
                        "name": "Xue X.-Y."
                    }
                ],
                "citationCount": 4,
                "date": "2019-09-18T00:00:00Z",
                "journal": "Journal of Translational Medicine",
                "title": "Identification of key DNA methylation-driven genes in prostate adenocarcinoma: An integrative analysis of TCGA methylation data"
            },
            "pmcid": "PMC6751626",
            "pmid": "31533842"
        }
    ],
    "topic": [
        {
            "term": "Epigenetics",
            "uri": "http://edamontology.org/topic_3295"
        },
        {
            "term": "Microarray experiment",
            "uri": "http://edamontology.org/topic_3518"
        },
        {
            "term": "Gene expression",
            "uri": "http://edamontology.org/topic_0203"
        }
    ]
}